src/InformationRegisters/ПоказателиБюджета/ПоказателиБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиБюджета</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВариантБюджета</name>
    <type>
      <types>CatalogRef.ВариантыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоПериода</name>
    <comment>Каелндарное начало периода, рассматриваемого в бюджете.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделБюджета</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПоказателя</name>
    <comment>(Инф.)</comment>
    <type>
      <types>EnumRef.ТипыБюджетныхПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафаБюджета</name>
    <type>
      <types>CatalogRef.ГрафыБюджета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>DefinedType.СтатьяБюджета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПоказателиБюджета/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

// При записи контролируются курсы подчиненных валют.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		// Для обеспечения обмена с мобильными приложениями на переходный период
		Если ЗначениеЗаполнено(Запись.ГрафаБюджета) И Не ЗначениеЗаполнено(Запись.ТипПоказателя) Тогда
			Запись.ТипПоказателя = Запись.ГрафаБюджета.ТипПоказателя;
			Если ЭтотОбъект.Количество() = 1 Тогда
				ЭтотОбъект.Отбор.ТипПоказателя.Установить(Запись.ТипПоказателя);
			КонецЕсли;
		ИначеЕсли Не ЗначениеЗаполнено(Запись.ГрафаБюджета) И ЗначениеЗаполнено(Запись.ТипПоказателя) Тогда
			Запись.ГрафаБюджета = БюджетированиеСервер.ГрафаБюжетаДляСтатьи(Запись.СтатьяБюджета, Запись.ТипПоказателя, Запись.РазделБюджета);
			Если ЭтотОбъект.Количество() = 1 Тогда
				ЭтотОбъект.Отбор.ГрафаБюджета.Установить(Запись.ГрафаБюджета);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
